{
    "MD5": "Weak, should not be used due to vulnerability to collision attacks.",
    "bcrypt": "Strong, recommended for password hashing due to its built-in salting and adaptive complexity.",
    "Apache MD5": "Weak, considered insecure for sensitive data; use bcrypt or stronger algorithms instead.",
    "SHA-256": "Strong, suitable for cryptographic use but not for password hashing (use bcrypt or Argon2 instead).",
    "SHA-512": "Strong, suitable for cryptographic use but not for password hashing (use bcrypt or Argon2 instead).",
    "Argon2i": "Strong, recommended for password hashing with resistance to brute-force and GPU attacks.",
    "Argon2d": "Strong, recommended for password hashing with resistance to brute-force and GPU attacks.",
    "Argon2id": "Strong, considered the most secure variant of Argon2 for password hashing.",
    "PBKDF2 with SHA-1": "Moderate, older but still widely used; recommended to use SHA-256 variant or Argon2.",
    "PBKDF2 with SHA-256": "Strong, suitable for password hashing with sufficient iterations.",
    "PBKDF2 with SHA-512": "Strong, suitable for password hashing with sufficient iterations.",
    "scrypt": "Strong, recommended for password hashing with built-in resistance to memory and GPU attacks.",
    "bcrypt with SHA-256": "Strong, combines bcrypt with SHA-256 for added security in password hashing.",
    "SHA-1": "Weak, vulnerable to collision attacks; not recommended for security purposes.",
    "SHA-384": "Strong, suitable for cryptographic use but not for password hashing.",
    "BLAKE2b": "Strong, faster than SHA-2; suitable for non-password cryptographic applications.",
    "BLAKE2s": "Strong, efficient and secure, suitable for non-password cryptographic applications.",
    "RIPEMD-160": "Moderate, considered secure but largely superseded by SHA-2 and BLAKE2.",
    "Whirlpool": "Strong, considered secure but rarely used in modern systems.",
    "Skein-256": "Strong, secure but rarely used; an alternative to SHA-2.",
    "Skein-512": "Strong, secure but rarely used; an alternative to SHA-2.",
    "GOST": "Weak, generally considered insecure by modern standards.",
    "GOST-crypto": "Weak, largely deprecated and not recommended.",
    "Tiger-128": "Weak, vulnerable and not recommended for secure hashing.",
    "Tiger-192": "Moderate, less common and superseded by stronger algorithms.",
    "HAVAL": "Weak, deprecated and vulnerable to collision attacks.",
    "CRC32": "Weak, not suitable for cryptographic use; only for checksums.",
    "Adler-32": "Weak, only suitable for checksums, not for security.",
    "Ed25519": "Strong, widely used for public key cryptography; not for password hashing.",
    "bcrypt PBKDF": "Strong, suitable for password hashing.",
    "SHA3-224": "Strong, a newer standard suitable for cryptographic use.",
    "SHA3-256": "Strong, suitable for cryptographic use.",
    "SHA3-384": "Strong, suitable for cryptographic use.",
    "SHA3-512": "Strong, suitable for cryptographic use.",
    "Keccak": "Strong, basis for SHA-3 standard.",
    "SHAKE128": "Strong, suitable for variable-length output hashing but not password hashing.",
    "SHAKE256": "Strong, suitable for variable-length output hashing but not password hashing.",
    "BLAKE2": "Strong, secure alternative to SHA-2 and SHA-3."
}