{
    "3389": "Remote Desktop Protocol, used for remote connections on Windows.",
    "5900": "Virtual Network Computing, used for remote desktop access.",
    "22": "SSH access; restrict access or use port knocking if needed.",
    "139": "File sharing on Windows networks, often exploited if open.",
    "445": "File sharing on Windows networks, often exploited if open.",
    "548": "Apple Filing Protocol, needed only on Apple networks.",
    "21": "Unencrypted file transfer protocol, should be replaced by SFTP.",
    "3306": "MySQL database; keep closed if external access isn't required.",
    "1433": "Microsoft SQL Server; avoid public access if possible.",
    "1434": "Microsoft SQL Server; avoid public access if possible.",
    "5432": "PostgreSQL database; close if not needed for remote access.",
    "1521": "Oracle Database; should ideally be firewalled and not exposed.",
    "25": "Mail transfer protocol; close unless hosting a mail server.",
    "110": "Used by mail clients to retrieve email, close if not needed.",
    "143": "Used by mail clients to retrieve email, close if not needed.",
    "80": "HTTP traffic; redirect to HTTPS (port 443) if possible.",
    "8080": "Used by dev tools or admin panels; restrict access if not necessary.",
    "23": "Insecure remote login; replace with SSH.",
    "161": "Device management; close unless specifically needed.",
    "162": "Device management; close unless specifically needed.",
    "69": "Lightweight unencrypted file transfer protocol, close unless needed.",
    "111": "Used for NFS and other RPC services; close if not needed.",
    "2049": "Network File System; close unless needed for remote file sharing.",
    "512": "Older remote management protocol; replace with SSH.",
    "513": "Older remote management protocol; replace with SSH.",
    "514": "Older remote management protocol; replace with SSH.",
    "8888": "Used by dev tools or admin dashboards; restrict access if not necessary.",
    "8181": "Used by dev tools or admin dashboards; restrict access if not necessary.",
    "5000": "Sometimes used by frameworks; avoid exposing to the public.",
    "5001": "Sometimes used by frameworks; avoid exposing to the public."
}